#### Terraform Plan
```
data.aws_iam_policy_document.lambda_assume: Reading...
aws_cloudwatch_event_rule.cron["cron_charlie"]: Refreshing state... [id=simple-lambda-dev-cron_charlie]
aws_cloudwatch_log_group.lambda: Refreshing state... [id=/aws/lambda/simple-lambda-dev]
aws_cloudwatch_event_rule.cron["cron_bob"]: Refreshing state... [id=simple-lambda-dev-cron_bob]
aws_ecr_repository.this: Refreshing state... [id=simple-lambda-dev]
data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
aws_iam_role.lambda: Refreshing state... [id=simple-lambda-dev-role]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=simple-lambda-dev-role-20260228224719217500000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_event_rule.cron["cron_stewart"] will be created
  + resource "aws_cloudwatch_event_rule" "cron" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "simple-lambda-dev-cron_stewart"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + state               = "ENABLED"
      + tags_all            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cron_rule_arns     = {
      + cron_stewart = (known after apply)
        # (2 unchanged attributes hidden)
    }

Error: reading CloudWatch Logs Log Group (/aws/lambda/simple-lambda-dev): operation error CloudWatch Logs: DescribeLogGroups, https response error StatusCode: 400, RequestID: a1c534a8-5300-4284-a9e6-fe1ed64d14b2, api error AccessDeniedException: User: arn:aws:iam::637423251679:user/simple-lambda-ci is not authorized to perform: logs:DescribeLogGroups on resource: arn:aws:logs:us-east-1:637423251679:log-group::log-stream: because no identity-based policy allows the logs:DescribeLogGroups action

  with aws_cloudwatch_log_group.lambda,
  on lambda.tf line 1, in resource "aws_cloudwatch_log_group" "lambda":
   1: resource "aws_cloudwatch_log_group" "lambda" {

::error::Terraform exited with code 1.

```